let Ip_Data = externaldata(
    network:string,
    geoname_id:string,
    continent_code:string,
    continent_name:string,
    country_iso_code:string,
    country_name:string
)
[
    'https://raw.githubusercontent.com/datasets/geoip2-ipv4/master/data/geoip2-ipv4.csv'
]
with (
    ignoreFirstRecord=true,
    format='csv'
);
SecurityEvent
| where TimeGenerated > ago(12h)
| where EventID == 4624 or EventID == 4625
| project TimeGenerated, Computer, TargetAccount, IpAddress
| where isnotempty(IpAddress)
| where IpAddress != "-"
| evaluate ipv4_lookup(Ip_Data, IpAddress, network)
